Revit 2026 API

# FamilyInstanceRemoveCoping Method

---

Removes a coping (cut) from a steel beam.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool RemoveCoping(
	FamilyInstance cutter
)
```
```vb
Public Function RemoveCoping (
	cutter As FamilyInstance
) As Boolean
```
```cpp
public:
bool RemoveCoping(
	FamilyInstance^ cutter
)
```
```fsharp
member RemoveCoping :
        cutter : FamilyInstance -> bool
```

#### Parameters

cutter FamilyInstance
    A steel beam or column for which this beam currently has a coping cut. May not be  or itself.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when 'cutter' is . |
| ArgumentException | Thrown when 'cutter' refers to this instance. |
| InvalidOperationException | Thrown when regeneration fails. |

This function corresponds to Tools -> Remove coping in Revit Structure.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace